Repository: EpicNicks/Calories-In-SimpleCalorieCounter-
Catalog: lib/l10n/app_*.arb
Languages: es, ja, zh_tw

# language
source: English
es: Español
ja: 日本語
zh_tw: 繁體中文

# dailyCalorieTotal
source: Total Daily Calories: {totalCalories}
es: Total de Calorías Diarias: {totalCalories}
ja: 今日のカロリー合計: {totalCalories}
zh_tw: 每日總熱量：{totalCalories}

# clearListWarningTitle
source: Really CLEAR the List?
es: ¿Realmente BORRAR la lista?
ja: リストを本当にクリアしますか？
zh_tw: 確定要清空列表嗎？

# clearListWarningBody
source: This will delete ALL of today's items
es: Esto eliminará TODOS los elementos de hoy
ja: これで今日の全てのアイテムが削除されます
zh_tw: 這將刪除今天的所有記錄

# calorieEntryHistoryTitle
source: Calorie Entry History
es: Historial de Entradas de Calorías
ja: カロリー入力ログ
zh_tw: 熱量記錄歷史

# calorieTrackingSubmenuTitle
source: Progress Tracking Options
es: Opciones de Seguimiento de Progreso
ja: "進捗トラッキングオプション
zh_tw: 進展追蹤選項

# calendarMenuItem
source: Calendar
es: Calendario
ja: カレンダー
zh_tw: 日曆

# caloriesTotalLabel
source: Total Calories: {totalCalories}
es: Calorías Totales: {totalCalories}
ja: 総カロリー: {totalCalories}
zh_tw: 總熱量：{totalCalories}

# yourFirstEntryText
source: Your first entry was on {date}
es: Tu primera entrada fue el {date}
ja: 最初の記録は{date}です
zh_tw: 你的首條記錄是在 {date}

# emptyHistoryMsg
source: You have no entries in your history yet
es: Aún no tienes entradas en tu historial
ja: まだ履歴にエントリーがない
zh_tw: 你的歷史記錄中還沒有任何記錄

# chartsMenuItem
source: Charts
es: Gráficos
ja: グラフ
zh_tw: 圖表

# showAverageLabel
source: Show Average
es: Mostrar Promedio
ja: 平均
zh_tw: 顯示平均值

# excludeTodayLabel
source: Exclude Today
es: Excluir Hoy
ja: 今日除外
zh_tw: 排除今天

# dateRangeLabel
source: Date Range
es: Rango de Fechas
ja: 日付の範囲
zh_tw: 日期範圍

# dateRage7Days
source: Past 7 Days
es: Últimos 7 Días
ja: 過去7日間
zh_tw: 過去7天

# dateRange30Days
source: Past 30 Days
es: Últimos 30 Días
ja: 過去30日間
zh_tw: 過去30天

# dateRangeMax
source: Max
es: Máximo
ja: 最大範囲
zh_tw: 最大

# caloriesGoalPlanLabel
source: Calories Goal Plan
es: Plan de Objetivo de Calorías
ja: カロリーゴールプラン
zh_tw: 熱量目標計劃

# caloriesGoalPlanNone
source: None
es: Ninguno
ja: なし
zh_tw: 無

# caloriesGoalPlanCustom
source: Custom
es: Personalizado
ja: カスタム
zh_tw: 自訂

# maintenanceCaloriesChartLabel
source: Maintenance Calories
es: Calorías de Mantenimiento
zh_tw: 維持熱量

# daysCaloriesChartLabel
source: Day's Calories
es: Calorías del Día
zh_tw: 每日熱量

# rangeAverageChartLabel
source: Range Average
es: Promedio del Rango
zh_tw: 範圍平均值

# yourPlanMenuItem
source: Your Plan
es: Tu Plan
ja: プラン
zh_tw: 你的計劃

# metricOption
source: Metric
es: Métrico
ja: メートル法
zh_tw: 公制

# imperialOption
source: Imperial
ja: ヤードポンド法
zh_tw: 英制

# genderMale
source: Male
es: Hombre
ja: 男
zh_tw: 男性

# genderFemale
source: Female
es: Mujer
ja: 女
zh_tw: 女性

source: Weight (kg)
es: Peso (kg)
ja: 体重（kg）
zh_tw: 體重（公斤）

source: Weight (lbs)
es: Peso (lbs)
ja: 体重（ポンド）
zh_tw: 體重（磅）

# heightMetric
source: Height (cm)
es: Altura (cm)
ja: 身長（cm）
zh_tw: 身高（厘米）

# heightFeet
source: Height (ft)
es: Altura (pies)
ja: 身長（フィート）
zh_tw: 身高（英尺）

# heightInches
source: Height (in)
es: Altura (pulgadas)
ja: 身長（インチ）
zh_tw: 身高（英寸）

source: Age
es: Edad
ja: 年齢（歳）
zh_tw: 年齡

# activityLevelLabel
source: Your activity level
es: Tu nivel de actividad
ja: 活動レベル
zh_tw: 你的活動水平

# activityLevelBedridden
source: Bedridden
es: Postrado en Cama
ja: 寝たきり
zh_tw: 卧床

# activityLevelSedentary
source: Sedentary
es: Sedentario
ja: 低い運動レベル
zh_tw: 久坐

# activityLevelLight
source: Light/1-3 Days Per Week
es: Ligero/1-3 Días por Semana
ja: 軽い（週1-3日）
zh_tw: 輕度/每週1-3天

# activityLevelModerate
source: Moderate/3-5 Days Per Week
es: Moderado/3-5 Días por Semana
ja: 適度な（週3-5日）
zh_tw: 適度/每週3-5天

# activityLevelHard
source: Hard Exercise/6-7 Days Per Week
es: Ejercicio Intenso/6-7 Días por Semana
ja: 激しい運動（週6-7日）
zh_tw: 劇烈運動/每週6-7天

# activityLevelExtreme
source: Extremely Active/Sports and Physical Job
es: Extremadamente Activo/Deportes y Trabajo Físico
ja: 非常に活発（スポーツ・肉体労働）
zh_tw: 極度活躍/體育和體力勞動工作

# calculateButtonLabel
source: Calculate
es: Calcular
ja: 計算する
zh_tw: 計算

# estimatedDailyNeedsLabel
source: Estimated Daily Calorie Needs: {calories}
es: Necesidades Diarias Estimadas de Calorías: {calories}
ja: 推定1日のカロリー必要量: {calories}
zh_tw: 估算每日熱量需求：{calories}

# customGoalPlanPrompt
source: Enter your daily calories target
es: Ingresa tu objetivo diario de calorías
zh_tw: 輸入你的每日熱量目標

# settingsTitle
source: Settings
es: Configuración
zh_tw: 設定

# faqLabel
source: FAQ
es: Preguntas Frecuentes
zh_tw: 常見問題

# tipsLabel
source: Tips and How Tos
es: Consejos y Guías
zh_tw: 提示和使用方法

# themeLabel
source: App Theme
es: Tema de la App
zh_tw: 應用主題

# exportImportLabel
source: Export/Import Data
es: Exportar/Importar Datos
zh_tw: 導入/導出數據

# supportLabel
source: Support the Developer
es: Apoyar al Desarrollador
zh_tw: 支持開發者

# faqMarkdown
source: # FAQ --- ## Usable Math Symbols for entries - +, -, x and *, / for mathematical operations - , (comma) to separate items within an entry \(this is semantically equivalent to addition\) --- ## Optional Notes on Entries You may label additional information, such as the name of the food logged or whatever else you would like in a comment by adding a : (colon) to your entry and adding your comment after, such as\\ **100+80+50: egg and toast w/ jam** ---
es: # Preguntas Frecuentes --- ## Símbolos Matemáticos Utilizables para Entradas - +, -, x y * para operaciones matemáticas - , (coma) para separar elementos dentro de una entrada \(esto es semánticamente equivalente a la suma\) --- ## Notas Opcionales en las Entradas Puedes etiquetar información adicional, como el nombre del alimento registrado o cualquier otra cosa que desees en un comentario agregando un : (dos puntos) a tu entrada y agregando tu comentario después, como\\ **100+80+50: huevo y tostada con mermelada** ---
zh_tw: # 常見問題 --- ## 可用的數學符號用於記錄 - +、-、x 和 * 用於數學運算 - 逗號（,）用於在記錄中分隔項目 \（這在語義上等同於加法\） --- ## 記錄中的可選注釋 你可以通過在記錄中添加冒號（:）並隨後添加你的注釋來標記額外的信息，例如食物名稱或其他內容，如\\ **100+80+50: 雞蛋和吐司配果醬** ---

# tipsMarkdown
source: # Tips and How Tos --- ## How to Calculate Partial Servings Partial Servings can be entered as: calories-per-serving x amount / amount-per-serving So if you had cereal that was measured in 60 gram servings, you ate 90 grams of it, and the amount of calories per serving is 200, The total calories can be entered as:\ **200 x 90 / 60** ***(=300)*** ---
es: # Consejos y Guías --- ## Cómo Calcular Porciones Parciales Las Porciones Parciales se pueden ingresar de la siguiente manera: calorías-por-porción x cantidad / cantidad-por-porción Así que si tienes cereales que se miden en porciones de 60 gramos, comiste 90 gramos de ellos y la cantidad de calorías por porción es 200, las calorías totales se pueden ingresar como:\ **200 x 90 / 60** ***(=300)*** ---
zh_tw: # 提示和使用方法 --- ## 如何計算部分份額 部分份額可以輸入如下方式： 每份熱量 x 數量 / 每份量 因此，如果你有以60克為單位的麥片，你吃了90克，每份熱量為200，總熱量可以輸入如下：\ **200 x 90 / 60** ***(=300)*** ---

# appThemeTitle
source: Change App Theme
es: Cambiar Tema de la App
zh_tw: 更改應用主題

# lightLabel
source: Light
es: Claro
zh_tw: 亮色

# darkLabel
source: Dark
es: Oscuro
zh_tw: 暗色

# systemLabel
source: System
es: Sistema
zh_tw: 跟隨系統

# exportImportDataTitle
source: Import/Export Calorie Data
es: Importar/Exportar Datos
zh_tw: 導入/導出熱量數據

# exportImportText1
source: You can convert your entry data to a CSV, saved locally. Ensure that you back up data before overwriting.
es: Puedes convertir tus datos de entradas en un archivo CSV, guardado localmente. Asegúrate de respaldar los datos antes de sobrescribir.
zh_tw: 你可以將你的記錄數據轉換為本地保存的 CSV 文件。在覆蓋之前確保備份了數據。

# exportImportText2
source: For export, this app requires you allow it to write to external storage as it is a .csv file and will ask for permission to do so
es: Para exportar, esta aplicación requiere permiso para escribir en el almacenamiento externo, ya que es un archivo .csv, y pedirá permiso para hacerlo.
zh_tw: 為了導出，此應用需要您允許它寫入外部存儲，因為它是一個 .csv 文件，會要求獲得權限。

# exportImportText3
source: The resulting file may be opened in Excel or any other program that accepts CSVs, as well as be used to import and overwrite data in this app.
es: El archivo resultante puede abrirse en Excel o cualquier otro programa que acepte archivos CSV, y también se puede usar para importar y sobrescribir datos en esta aplicación.
zh_tw: 導出的文件可以在 Excel 或任何接受 CSV 格式的程式中打開，也可以用於導入和覆蓋此應用中的數據。

# exportImportExportLabel
source: Export
es: Exportar
zh_tw: 導出

# exportImportImportLabel
source: Import
es: Importar
zh_tw: 導入

# exportImportSavingMsg
source: saving file...
es: guardando archivo...
zh_tw: 正在保存文件...

# exportImportSavedFileMsg
source: Saved file to {path}
es: Archivo guardado en {path}
ja: Saved file to
zh_tw: 文件已保存至 {path}

# exportImportFailureMsg
source: Export unsuccessful.
es: Exportación fallida.
zh_tw: 導出失敗。

# exportImportOverwriteWarningHeader
source: Really OVERWRITE all data?
es: ¿Realmente SOBRESCRIBIR todos los datos?
zh_tw: 確定要覆蓋所有數據嗎？

# exportImportOverwriteWarningBody
source: This will clear all previous content. Ensure you have made a backup of your current data with 'Export' before proceeding
es: Esto eliminará todo el contenido anterior. Asegúrate de haber realizado una copia de seguridad de tus datos actuales con 'Exportar' antes de continuar
zh_tw: 這將清除所有先前內容。在繼續之前，請確保通過“導出”創建了當前數據的備份。

# exportImportOverwriteWarning2Header
source: Are you sure?
es: ¿Estás seguro?
zh_tw: 你確定嗎？

# exportImportOverwriteWarning2Body
source: Ensure you have backed up your data with 'Export'. You cannot recover your initial data after.
es: Asegúrate de haber respaldado tus datos con 'Exportar'. No podrás recuperar tus datos iniciales después.
zh_tw: 在繼續之前，請確保通過“導出”創建了數據的備份。之後將無法恢復最初的數據。

# exportImportOverwriteConfirm
source: Confirm Overwrite
es: Confirmar Sobrescritura
zh_tw: 確認覆蓋

# exportImportDataMalformedErrorMsg
source: Data was malformed, not all rows were length 3
es: Los datos estaban mal formateados, no todas las filas tenían una longitud de 3
zh_tw: 數據格式錯誤，不是所有行的長度都為3

# supportTitle
source: Support the Developer
es: Apoyar al Desarrollador
zh_tw: 支持開發者

# supportBody
source: If this app has helped you achieve your goals, or you appreciate it over other apps available to you, or whatever the reason, consider supporting me by sending me a tip on the ko-fi link below.
es: Si esta aplicación te ha ayudado a alcanzar tus objetivos, o la prefieres sobre otras aplicaciones disponibles, o por cualquier razón, considera apoyarme enviándome una propina en el enlace de Ko-fi que se encuentra abajo.
zh_tw: 如果此應用幫助你實現了目標，或者你喜歡它勝過其他可用的應用，或者出於其他原因，考慮通過下面的 Ko-fi 鏈接向我贊助一下。

# versionLabel
source: version number: {versionNumber}
es: número de versión: {versionNumber}
zh_tw: 版本號：{versionNumber}

# continueButton
source: Continue
es: Continuar
ja: OK
zh_tw: 繼續

# cancelButton
source: Cancel
es: Cancelar
ja: キャンセル
zh_tw: 取消

# loadingText
source: Loading...
es: Cargando...
ja: 読み込み中...
zh_tw: 載入中...

# editCaloriesCalendarButton
source: Edit
zh_tw: 編輯

# searchMenuItem
source: Search
zh_tw: 搜尋

# searchMenuHintText
source: Search by calorie expression or date...
zh_tw: 按熱量表達式或日期搜尋...

# searchMenuExpressionColumnLabel
source: Expression
zh_tw: 表達式

# searchMenuCaloriesColumnLabel
source: Calories
zh_tw: 卡路里

# searchMenuDateColumnLabel
source: Date
zh_tw: 日期

# searchMenuResultText
source: {amount, plural, =1{Found 1 result} other{Found {amount} results}}
zh_tw: {amount, plural, =1{找到1個結果} other{找到{amount}個結果}}

# searchMenuNoItemsText1
source: No food items found
zh_tw: 未找到食物項目

# searchMenuNoItemsText2
source: Add some food items to get started
zh_tw: 新增一些食物項目來開始使用

# searchMenuNoItemsFoundText1
source: No results found
zh_tw: 未找到結果

# searchMenuNoItemsFoundText2
source: Try adjusting your search terms
zh_tw: 嘗試調整搜尋關鍵字

# caloriesGoalPlanMSJ
source: Mifflin-St Jeor
ja: ミフリンセイントジョア
